// Створюємо приватне статичне поле #groups використовується для зберігання усіх створених груп. Має початкове значени: пустий об'єкт
//Об'єкт використовується для зберігання груп, де ключ - це назва групи, а значення - екземпляр групи.
// Створюмєо конструктор класу, який приймає назву групи як аргумент та ініціалізує поле this.name.
// Створюємо статичний метод create, який приймає назву групи name як аргумент.
// Метод завжди повертає екземпляр групи з вказаною назвою.
// Перевірка чи група з такою назвою ще не була створена
// то вона створюється та зберігається в полі #groups.
// в кінці повертає #groups[name]
// Клас Product відповідає за створення продуктів.
class Product {
  constructor(name, group) {
    this.name = name;
    this.group = group;
  }
}
